## Staging: ecs
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 1 to add, 1 to change, 1 to destroy
```

<details>
<summary>Show summary</summary>

|  CHANGE  |                            NAME                             |
|----------|-------------------------------------------------------------|
| recreate | `module.localisation_services.aws_ecs_task_definition.this` |
| update   | `module.localisation_services.aws_ecs_service.this`         |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.localisation_services.aws_ecs_service.this will be updated in-place
  ~ resource "aws_ecs_service" "this" {
        id                                 = "arn:aws:ecs:ca-central-1:817721384391:service/localisation-services/weblate"
        name                               = "weblate"
        tags                               = {
            "CostCentre" = "platform-core-services"
            "Terraform"  = "true"
        }
      ~ task_definition                    = "arn:aws:ecs:ca-central-1:817721384391:task-definition/weblate:23" -> (known after apply)
        # (15 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.localisation_services.aws_ecs_task_definition.this must be replaced
-/+ resource "aws_ecs_task_definition" "this" {
      ~ arn                      = "arn:aws:ecs:ca-central-1:817721384391:task-definition/weblate:23" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:ca-central-1:817721384391:task-definition/weblate" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [
              ~ {
                  - cpu                    = 0
                  - essential              = true
                  ~ mountPoints            = [
                      + {
                          + containerPath = "/app/data"
                          + readOnly      = false
                          + sourceVolume  = "efs-app-data"
                        },
                    ]
                    name                   = "weblate"
                  - volumesFrom            = []
                    # (7 unchanged attributes hidden)
                },
            ] # forces replacement
        )
      ~ id                       = "weblate" -> (known after apply)
      ~ revision                 = 23 -> (known after apply)
        tags                     = {
            "CostCentre" = "platform-core-services"
            "Terraform"  = "true"
        }
        # (9 unchanged attributes hidden)

      + volume { # forces replacement
          + name = "efs-app-data"

          + efs_volume_configuration {
              + file_system_id          = "fs-0edd3f4144ccf1b89"
              + root_directory          = "/app/data"
              + transit_encryption      = "ENABLED"
              + transit_encryption_port = 2049
            }
        }

        # (1 unchanged block hidden)
    }

Plan: 1 to add, 1 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh

18 tests, 18 passed, 0 warnings, 0 failures, 0 exceptions

```

</details>
